---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.ServiceType
source: html/f6fa2563-3e68-a8cb-16f2-e4188c54125e.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.ServiceType Property

The type of heating or cooling system.

## Syntax (C#)
```csharp
public gbXMLServiceType ServiceType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The service type does not fall within an appropriate range.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration